CSI API ETABS v1
cHelper.CreateObjectHostPort Method
 Starts the program at the given path on a given computer using the given TCP port.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI CreateObjectHostPort(
	string hostName,
	int portNumber,
	string fullPath
)
Function CreateObjectHostPort (
	hostName As String,
	portNumber As Integer,
	fullPath As String
) As cOAPI
Dim instance As cHelper
Dim hostName As String
Dim portNumber As Integer
Dim fullPath As String
Dim returnValue As cOAPI
returnValue = instance.CreateObjectHostPort(hostName,
	portNumber, fullPath)
cOAPI^ CreateObjectHostPort(
	String^ hostName,
	int portNumber,
	String^ fullPath
)
abstract CreateObjectHostPort :
        hostName : string *
        portNumber : int *
        fullPath : string -> cOAPI
Parameters
hostName
Type: System.String
The host computer name.
portNumber
Type: System.Int32
The TCP port to connect to the host computer.
fullPath
Type: System.String
The full path to the program executable on the host computer.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
CSiAPIService.exe for must be running on the host computer and listening to the given TCP port for the call to succeed.
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.CreateObjectHostPort("RemoteServer", 8500, "C:\Program Files\Computers and Structures\ETABS 19\ETABS.exe")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace